---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FillPatternElement
source: html/92009658-18a0-96e4-87af-b4fe08063518.htm
---
# FillPatternElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.